'use strict';

// =========================================================================


// Вариант №1 будет ложь
// if (1 === '1') {
// 	console.log('Истина!');
// } else{
// 	console.log('Ложь!');
	
//  }
//  Вариант №2 true
/*if (5 == '5'){
	console.log('Истина!');
} else{
	console.log('Ложь!');
}
*/

/*  Вариант №3 true оператор больше перевидет строку
 в число и мы получим истину */ 

 /* Вариант №4 виведе else if тому що if = false  */ 

  /*  */

// =====================Циклы for,while=====================

//   ====================Задача№1===========================================
	/* let num = 1;
	while (num < 6){
		console.log(num);
		num++
	}
	*/
// ======================Задача№2=================================
// Последний результат 1 потому что 0-это false
	// let num = 8;
	// while(num){
	// 	console.log(num);
	// 	num--;
	// }
	
// ======================Задача№3=================================

// let num = 0;
// while(num < 3){
// 	console.log(`Число: ${num}`);
// 	num++;
// }
	
// ======================Задача№4=================================

// firstFor: for(let num = 0; num < 2; num++){
// 	for(let size = 0; size < 3; size++){
// 		if(size == 1) {
// 			break firstFor;
// 		} 
// 		console.log(size)
// 	}
// }

// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// =====================Типы данных number=====================

//   ====================Задача№1===========================================

	// let numTwo = 1.005 + Number.EPSILON
	// let munOne = Math.round(numTwo * 100) / 100;
	// console.log(munOne);

//   ====================Задача№1===========================================

	// let value = parseFloat('135.58px');
	// console.log(value);


//   ====================Задача№3===========================================
	// let value = 58 + 'Фрилансер';

	// if(58 + 'Фрилансер' !== NaN){
	// 	console.log('Результат выражения NaN');
		
	// }

//   ====================Задача№4===========================================

	// let num = Math.min(18,58,39,-150.0);
	// console.log(num);


//   ====================Задача№4===========================================

	// console.log(Math.floor(58.858));

// ==========================================================	
	
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ==========================String================================



// =========================Задача №1=================================

	// let fls = "'фрилансер'";
	// let text = 'Привет Я ${fls}'; 
	// // Все верно!
	// console.log(text);

// =========================Задача №2=================================

	// let text = 'фрилансер';
	// console.log(text.slice(5,6));

// =========================Задача №3=================================

	// let text = 123 + "456";
	// // Не верно! Потомучто получиться строка 123456!
	// console.log(text);

// =========================Задача №4=================================

	// let text = 'фрилансер';
	// console.log(text.toUpperCase());

// =========================Задача №5=================================

	// let text = 'фрилансер';
	// console.log(text.includes('лан'));

// =========================Задача №6=================================

	// let text = 'фрилансер';
	// console.log(text.includes('лан', 4));
// false! Потому что подстрока начинается с 3 символа


